# AngularDimensionsOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetailType..::..AngularDimensionsOffset Property
RebarBendingDetailType Class See Also
---
Identifies the offset of the angular dimensions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double AngularDimensionsOffset { get; set; }
```

Visual Basic
---
```text
Public Property AngularDimensionsOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AngularDimensionsOffset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for angularDimensionsOffset must be between 0 and 30000 feet. |

# See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace